app/controllers/home_controller.rb

  def autocomplete_user_name
    flag=true
    hr_flag=false
    flag=false if params[:flag] and !params[:flag].empty? and params[:flag]=="false"
    hr_flag=true if params[:flag] and !params[:flag].empty? and params[:flag]=="hr"
    flag=hr_flag=true if @admin
    @users = User.find( :all,
       :conditions => [ "status=#{flag} and hr_status=#{hr_flag} and LOWER(name) LIKE ?",
          "#{params[:user][:name].downcase}%" ] )
---
SELECT * FROM "users" WHERE (status=false and hr_status=false and LOWER(name) LIKE 's%')

  def index
    status="status=true and"
    status =" " if params[:flag].to_s=='dob' and @admin
    hr_status=false
    hr_cond="status=true and hr_status=#{hr_status}"
    hr_false="status=false and hr_status=#{hr_status}"
    if @admin
      hr_status=true
      hr_cond="status=true or hr_status=#{hr_status}"
      hr_false="status=false"
    end
    @sno=1
    @sno=(@@per_page.to_i*params[:page].to_i)-(@@per_page.to_i-1) if params[:page] and params[:page]!=""
    @user=User.find_by_id(session[:user_id])
    if  params[:flag] and params[:flag].to_s=="hr"
      @users=User.paginate :all ,:conditions=>"status=true and hr_status=true" , :order=>"name",:page => params[:page], :per_page => @@per_page
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT * FROM "users" WHERE (status=true and hr_status=false and LOWER(name) like 'sharanya%') ORDER BY order_by LIMIT 6 OFFSET 0
SELECT count(*) AS count_all FROM "users" WHERE (status=true and LOWER(name) like '%')

  def edit
    @user = User.find_by_id(params[:user_id]) if params[:user_id] != nil
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def update
    if params[:user]
      @user = User.find_by_id(params[:user_id]) if params[:user_id] != nil
      if @user.update_attributes(:name=>params[:user][:name],:dob=>params[:user][:dob],:qualification=>params[:user][:qualification],:occupation=>params[:user][:occupation],:relationship=>params[:user][:relationship],:mobile=>params[:user][:mobile],:comment=>params[:user][:comment],
                                 :address=>params[:user][:address],:email=>params[:user][:email],:language_id=>params[:user][:language_id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
UPDATE "users" SET "comment" = '', "updated_at" = '2010-06-12 09:46:10.984000', "qualification" = 'MCA', "occupation" = 'Software Developer' WHERE "id" = 1

  def delete
    begin
      flag=false
      flag=true if params[:flag] and params[:flag]=='false'
    @user=User.find_by_id(params[:user_id])if params[:user_id] != nil
    if @user and @user!=nil
        if @user.update_attribute(:status,flag)
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
UPDATE "users" SET "status" = 'f', "updated_at" = '2010-06-21 10:20:34.515000' WHERE "id" = 1