app/controllers/password_resets_controller.rb

  def edit
    @user = User.find_by_id(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def create
    @user = User.find_by_email(params[:email])
---
SELECT * FROM "users" WHERE ("users"."email" = 'd.prabhu2007@gmai.com') LIMIT 1

  def update
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    if @user.save
---
UPDATE "users" SET "password_hash" = '2a53339b1d31e6e9e229fbd2a7dfb8e62ef899d6', "updated_at" = '2010-06-24 10:42:05.437000', "password_salt" = '85ea67e4854fd01a8fd165e840987b1b729d35b2' WHERE "id" = 1

  def load_user_using_perishable_token
    #@user = User.find_using_perishable_token(params[:id])
    @user = User.find_by_id(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1