app/controllers/users_controller.rb

INSERT INTO "users" ("name", "photo", "occupation", "status", "company", "dob", "updated_at", "username", "role", "password_salt", "gender", "mobile", "relationship", "language_id", "password_hash", "hr_status", "order_by", "qualification", "age", "address", "comment", "email", "created_at") VALUES('hr', NULL, '', 't', NULL, '1980-06-17', '2010-06-26 10:23:24.156000', 'hr', 'others', '49fb1ff5aedd4683317f006a9056e0db2e24999c', 'f', '1234567890', '', NULL, 'a3542616fa0db1c61671ca41f79ec03acd1fd560', 'f', NULL, '', NULL, '', 'No feedback', 'hr@sample.com', '2010-06-26 10:23:24.156000') RETURNING "id"
SELECT * FROM "users" WHERE ("users"."id" = 14) LIMIT 1
UPDATE "users" SET "mobile" = NULL, "dob" = NULL, "name" = NULL, "password_hash" = '02851aae83edc3e78e464d262932aa6ad979e89d', "relationship" = NULL, "comment" = NULL, "address" = NULL, "gender" = 'f', "updated_at" = '2010-06-08 18:52:21.545000', "password_salt" = '8005b5085a8e53304432a7be19695a1fc040693f' WHERE "id" = 12
---
  def create
    hr_status=false
    puts params[:user].inspect
    puts params.inspect
    @user = User.new(params[:user])
    if @user.save
      session[:user_id] = @user.id
      if params[:user][:gender]=='male'
          gender=true
      else
          gender=false
      end
       hr_status=true if params[:user][:hr_status]=='yes'
      puts hr_status
      if params[:user][:dob]!=nil
        cyear=Time.now.year
        byear=params[:user][:dob].to_date.strftime("%Y").to_i
        age=cyear-byear
      end

      @user=User.find_by_id(@user.id)
      if hr_status
        puts "enter"
        if @user.update_attributes(:name=>params[:user][:name],:dob=>params[:user][:dob],:age=>age,:gender=>gender, :mobile=>params[:user][:mobile], :company=>params[:user][:company],:hr_status=>hr_status,:role=>"hr",:relationship=>"HR",:occupation=>"HR Dept.")